In [1]:
from IPython.display import display, HTML
display(HTML("""
<style>
div.container{width:90% ! important;}
div.cell.code_cell.rendered{width:100%}
div.input_prompt{padding:0px}
div.CodeMirror {font-family:Consolas ; font-size:12pt;}
div.text_cell_render.rendered_html {font-size:12pt;}
div.output {font-size:12pt; font-weight:bold}
div.input {font-family:Consolas ; font-size:12pt;}
div.prompt {min-width:70px;}
div#toc-wrapper {padding-top:120px;}
div.text_cell_render ul li{font-size:12pt;padding:5px;}
table.dataframe{font-size:12px;}
</style>
"""))

<b><font size="6" color="red">ch.11 데이터 프레임과 시리즈(Pandas)</font></b>
- pip install pandas
# 1절 판다스 패키지
- 데이터 분석을 위해 반드시 알아야 할 패키지. 넘파이를 기반으로 하며, 다른 많은 라이브러리와 잘 통합되도록 설계

- 2차원 구조를 갖는 데이터프레임, 1차원 구조를 갖는 시리즈를 제공

- 판다스 장점 : 
            * 데이터프레임생성, 파일io, 레이블링, 부분데이터 추출
            * 크기변경(행이나 열 삽입, 삭제), 데이터 분할, 병합, 데이터 구조 변경,
            * 결측치 처리, 

- https://pypi.python.org/pypi/pandas(package index)
- http://pandas.pydata.org/pandas-docs/stable/api.html(API reference)

In [2]:
import pandas as pd
pd.__version__

'1.5.3'

In [7]:
data=pd.read_json('data/ch09_member1.json', encoding="cp949") # 기본 인코딩 = "utf-8"
display(data) # print(data)를 마지막에 넣지 않으면 보기 싫게 나온다. 이 때는 display(data)를 사용하자
print(type(data))

  Name  Age             Email Address
0  신길동   30  sindong@hong.com      서울
1  김길동   40  kimdong@hong.com      부산
2  홍길동   20  kildong@hong.com      대전

<class 'pandas.core.frame.DataFrame'>

In [9]:
member4 = pd.read_csv('data/ch09_member4.csv')
member4

  Name  Age             Email Address
0  신길동   30  sindong@hong.com      서울
1  김길동   40  kimdong@hong.com      수원
2  홍길동   20  kildong@hong.com      안양

In [11]:
member1 = pd.read_csv('data/ch09_member1.csv',header=None, names=['name', 'email', 'address']) # ※ 주의 머릿글이 없을 때 header를 생략하면 첫번째 값이 머릿글로 출력됨
member1

     name             email   address
홍길동    20  kildong@hong.com   서울시 관악구
김길동    40  kimdong@hong.com  서울시 영등포구
신길동    30  sindong@hong.com   서울시 동작구

# 2절 데이터 프레임 만들기
## 2.1 딕셔너리 리스트를 이용해서 데이터 프레임 만들기

In [4]:
d=[{'kor':100, 'mat':95}, {'kor':90, 'mat':99}]
df = pd.DataFrame(data=d)
df

   kor  mat
0  100   95
1   90   99

In [5]:
df.to_dict() # 데이터프레임을 딕셔너리로

{'kor': {0: 100, 1: 90}, 'mat': {0: 95, 1: 99}}

In [6]:
df.to_numpy() # 데이터프레임을 넘파이배열
df.values # 데이터프레임을 넘파이배열 이 쪽을 좀 더 쓰는 것 같음

array([[100,  95],
       [ 90,  99]], dtype=int64)

In [7]:
df.dtypes # 열의 타입

kor    int64
mat    int64
dtype: object

In [8]:
df.info() # ★

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   kor     2 non-null      int64
 1   mat     2 non-null      int64
dtypes: int64(2)
memory usage: 160.0 bytes

In [9]:
df['kor'].dtype

dtype('int64')

In [10]:
# 타입변경(열마다)
import numpy as np
df['kor'].astype(np.float64)
# df['kor'].astype('float64') # import numpy를 쓰기 싫은 경우
df['kor']=df['kor'].astype(np.float64) # kor열의 타입을 float64로

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   kor     2 non-null      float64
 1   mat     2 non-null      int64
dtypes: float64(1), int64(1)
memory usage: 160.0 bytes

In [33]:
d=[{'kor':100.0, 'mat':95}, {'kor':90, 'mat':99},{'kor':92, 'eng':99}]
df = pd.DataFrame(data=d)
df

     kor   mat   eng
0  100.0  95.0   NaN
1   90.0  99.0   NaN
2   92.0   NaN  99.0

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   kor     3 non-null      int64
 1   mat     2 non-null      float64
 2   eng     1 non-null      float64
dtypes: float64(2), int64(1)
memory usage: 200.0 bytes

In [30]:
type(np.nan) # np.nan(결측치)

float

In [34]:
df['kor']=df['kor'].astype('int32')
df

   kor   mat   eng
0  100  95.0   NaN
1   90  99.0   NaN
2   92   NaN  99.0

In [37]:
# 결측치는 int로 형변환 불가(결측치는 대체값으로 치환 후 변환)
# df['mat']= df['mat'].astype('int32')

## 2.2 리스트를 이용해서 데이터프레임 만들기

In [39]:
kor = [100,90,95,90,65]
mat = [99,100,95,98,94]
df = pd.DataFrame({'kor':kor, 'mat':mat})
df.head(2) # 상위 2행만 출력

   kor  mat
0  100   99
1   90  100

In [40]:
np.c_[kor,mat]

array([[100,  99],
       [ 90, 100],
       [ 95,  95],
       [ 90,  98],
       [ 65,  94]])

In [43]:
df = pd.DataFrame(data=np.c_[kor,mat],columns=['국어', '수학'])
df

    국어   수학
0  100   99
1   90  100
2   95   95
3   90   98
4   65   94

In [45]:
df.shape

(5, 2)

In [47]:
l = [['트렌드 코리아2026', '김난도', 18000, 10],
     ['사찬탱고', '라슬로', 17820, 10],
     ['미술관 여행자', '카미유주노', 29700, 10]]
df = pd.DataFrame(l,columns=['작가이름','저자','가격','할인율'])
df

          작가이름     저자     가격  할인율
0  트렌드 코리아2026    김난도  18000   10
1         사찬탱고    라슬로  17820   10
2      미술관 여행자  카미유주노  29700   10

In [ ]:
# %ls : ipython 매직 명령어
# !dir : 쉘 명령어

In [50]:
%ls "c:/ai/downloads/shareData/상가정보/"

 C 드라이브의 볼륨에는 이름이 없습니다.
 볼륨 일련 번호: A014-DCD6

 c:\ai\downloads\shareData\상가정보 디렉터리

2025-10-13  오후 03:51    <DIR>          .
2025-10-13  오후 03:51    <DIR>          ..
2025-04-27  오후 11:07             1,011 [필독]파일열람방법.txt
2025-04-27  오후 11:07        61,227,944 소상공인시장진흥공단_상가(상권)정보_강원_202503.csv
2025-04-27  오후 11:07       356,572,082 소상공인시장진흥공단_상가(상권)정보_경기_202503.csv
2025-04-27  오후 11:07        93,472,559 소상공인시장진흥공단_상가(상권)정보_경남_202503.csv
2025-04-27  오후 11:07        76,425,275 소상공인시장진흥공단_상가(상권)정보_경북_202503.csv
2025-04-27  오후 11:07        40,070,868 소상공인시장진흥공단_상가(상권)정보_광주_202503.csv
2025-04-27  오후 11:07        61,715,005 소상공인시장진흥공단_상가(상권)정보_대구_202503.csv
2025-04-27  오후 11:07        41,491,092 소상공인시장진흥공단_상가(상권)정보_대전_202503.csv
2025-04-27  오후 11:07        84,550,600 소상공인시장진흥공단_상가(상권)정보_부산_202503.csv
2025-04-27  오후 11:07       294,549,483 소상공인시장진흥공단_상가(상권)정보_서울_202503.csv
2025-04-27  오후 11:07         9,303,432 소상공인시장진흥공단_상가(상권)정보_세종_202503.csv
2025-04-27  오후 11:07        28,457,489 소상공인시장진흥공단_상가(상권)정보_울산_202503.csv
2025-04-27  오후 11:07        73,022,149 소상공인시장진흥공단_상가(상권)정보_인천_202503.csv
2025-04-27  오후 11:07        52,997,974 소상공인시장진흥공단_상가(상권)정보_전남_202503.csv
2025-04-27  오후 11:07        56,252,705 소상공인시장진흥공단_상가(상권)정보_전북_202503.csv
2025-04-27  오후 11:07        32,943,677 소상공인시장진흥공단_상가(상권)정보_제주_202503.csv
2025-04-27  오후 11:07        66,591,896 소상공인시장진흥공단_상가(상권)정보_충남_202503.csv
2025-04-27  오후 11:07        50,727,673 소상공인시장진흥공단_상가(상권)정보_충북_202503.csv
              18개 파일       1,480,372,914 바이트
               2개 디렉터리  155,361,124,352 바이트 남음

In [53]:
df=pd.read_csv('c:/ai/downloads/shareData/상가정보/소상공인시장진흥공단_상가(상권)정보_서울_202503.csv',
           encoding="utf-8", sep=",", #encoding 와 sep는 헤당 값이 기본값이라 생략가능
            nrows=70) # 처음 70행만 가져옴
df.shape

(70, 39)

In [54]:
df.head(1) # 상위 1행만

,상가업소번호,상호명,지점명,상권업종대분류코드,상권업종대분류명,상권업종중분류코드,상권업종중분류명,상권업종소분류코드,상권업종소분류명,표준산업분류코드,...,건물관리번호,건물명,도로명주소,구우편번호,신우편번호,동정보,층정보,호정보,경도,위도
0,MA010120220800000033,부동산임대김은숙,NaN,I2,음식,I212,비알코올,I21201,카페,I56229,...,1111014000100280021026727,NaN,서울특별시 종로구 삼청로 122-1,110230,3053,NaN,NaN,NaN,126.98184,37.58625

In [56]:
# 판다스 디스플레이 옵션
pd.options.display.max_columns = 39 # 39열 까지 display가능. 기본값은 20
pd.options.display.max_rows = 70 # 70행 까지 display가능. 기본값은 60

In [57]:
df.head(1)

,상가업소번호,상호명,지점명,상권업종대분류코드,상권업종대분류명,상권업종중분류코드,상권업종중분류명,상권업종소분류코드,상권업종소분류명,표준산업분류코드,표준산업분류명,시도코드,시도명,시군구코드,시군구명,행정동코드,행정동명,법정동코드,법정동명,지번코드,대지구분코드,대지구분명,지번본번지,지번부번지,지번주소,도로명코드,도로명,건물본번지,건물부번지,건물관리번호,건물명,도로명주소,구우편번호,신우편번호,동정보,층정보,호정보,경도,위도
0,MA010120220800000033,부동산임대김은숙,NaN,I2,음식,I212,비알코올,I21201,카페,I56229,기타 비알코올 음료점업,11,서울특별시,11110,종로구,11110540,삼청동,1111014000,삼청동,1111014000100280021,1,대지,28,21.0,서울특별시 종로구 삼청동 28-21,111103100007,서울특별시 종로구 삼청로,122,1.0,1111014000100280021026727,NaN,서울특별시 종로구 삼청로 122-1,110230,3053,NaN,NaN,NaN,126.98184,37.58625

In [58]:
df.head(1).T

                                   0
상가업소번호          MA010120220800000033
상호명                         부동산임대김은숙
지점명                              NaN
상권업종대분류코드                         I2
상권업종대분류명                          음식
상권업종중분류코드                       I212
상권업종중분류명                       비알코올
상권업종소분류코드                     I21201
상권업종소분류명                          카페
표준산업분류코드                      I56229
표준산업분류명                 기타 비알코올 음료점업
시도코드                              11
시도명                            서울특별시
시군구코드                          11110
시군구명                             종로구
행정동코드                       11110540
행정동명                             삼청동
법정동코드                     1111014000
법정동명                             삼청동
지번코드             1111014000100280021
대지구분코드                             1
대지구분명                             대지
지번본번지                             28
지번부번지                           21.0
지번주소             서울특별시 종로구 삼청동 28-21
도로명코드                   111103100007
도로명                    서울특별시 종로구 삼청로
건물본번지                            122
건물부번지                            1.0
건물관리번호     1111014000100280021026727
건물명                              NaN
도로명주소            서울특별시 종로구 삼청로 122-1
구우편번호                         110230
신우편번호                           3053
동정보                              NaN
층정보                              NaN
호정보                              NaN
경도                         126.98184
위도                          37.58625

## 2.3 read_csv

In [59]:
pd.read_csv?

In [61]:
# (1) CSV파일 불러오기(기본값)
member = pd.read_csv('data/ch11_member.csv',
                    #, encoding='utf-8', sep=',', comment 주석처리x
                    )
member.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     6 non-null      object
 1   Age      6 non-null      int64
 2   Email    6 non-null      object
 3   Address  6 non-null      object
 4   Birth    6 non-null      object
dtypes: int64(1), object(4)
memory usage: 368.0+ bytes

In [66]:
# 문자형으로 읽어들인 Birth를 datetime형으로
# 형변환 : astype('int64'), astype('datetime64' : 비추)
#         to_datetime()함수
# member['Birth'].astype('datetime64') 
member['Birth']=pd.to_datetime(member['Birth'])
member.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     6 non-null      object
 1   Age      6 non-null      int64
 2   Email    6 non-null      object
 3   Address  6 non-null      object
 4   Birth    6 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 368.0+ bytes

In [68]:
member['Age'] = member['Age'].astype(np.int16)
member.dtypes

Name               object
Age                 int16
Email              object
Address            object
Birth      datetime64[ns]
dtype: object

In [70]:
# (2) 특정행을 제외하고 csv 파일 읽어오기
members = pd.read_csv('data/ch11_membercp949.csv', encoding='cp949',
                      skiprows=[1,6]) # 1,6번째 행 제외하고 읽어오기(시작은 1부터) 
members

  Name  Age         Email  Address       Birth
0  홍길서   30  seo@hong.com   서울시 중구  1999-12-01
1  홍길남   21  nam@hong.com  서울시 강동구  1999-11-01
2  홍길북   22  buk@hong.com  서울시 관악구  1999-05-01
3  홍길중   23  mid@hong.com   부산시 중구  1999-01-30

In [73]:
# (3) 상위 몇 행만 sep문자는 , 아닌 csv 파일 읽어오기
member = pd.read_csv('data/ch11_membersep.csv',sep='|',
                     nrows=5) # 상위 5행만
member

  Name  Age          Email  Address       Birth
0  홍길동   20  hong@hong.com  서울시 강동구  1999-01-01
1  홍길서   30   seo@hong.com   서울시 중구  1999-12-01
2  홍길남   21   nam@hong.com  서울시 강동구  1999-11-01
3  홍길북   22   buk@hong.com  서울시 관악구  1999-05-01
4  홍길중   23   mid@hong.com   부산시 중구  1999-01-30

In [77]:
# (4) 주석(#)제외, datetime형 필드를 지정하여 csv 파일 앍어오기
member = pd.read_csv('data/ch11_membertab.csv',sep='\t',
                    comment='#', # 주석제거
                    parse_dates=['Birth']) # datetime64형으로 읽어올 필드 지정
member.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     5 non-null      object
 1   Age      5 non-null      int64
 2   Email    5 non-null      object
 3   Address  5 non-null      object
 4   Birth    5 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 328.0+ bytes

## 2.4 패키지에서 가져오기 : iris 데이터
- iris 가져오는 방법1 : sklearn(머신러닝 패키지)
- iris 가져오는 방법2 : statsmodels(R 데이터)
- iris 가져오는 방법3 : seaborn(시각화 패키지)
### 2.4.1 iris방법1 : sklearn
- sklearn.datasets 모듈 데이터(iris)를 데이터 프레임으로 변환

In [12]:
from sklearn import datasets # 머신러닝을 공부할 때 필요한 학습데이터셋 재공
# sklearn 패키지에서 제공되는 데이터셋은 딕셔너리 형식으로 제공
iris = datasets.load_iris()
print(type(iris)) # Bunch타입(딕셔너리를 상속받은 타입) 딕셔너리처럼 동작
# print(iris.DESCR) # iris 데이터셋의 설명
print(iris.keys())

<class 'sklearn.utils._bunch.Bunch'>
dict_keys(['data', 'target', 'frame', 'target_names', 'DESCR', 'feature_names', 'filename', 'data_module'])

In [10]:
iris.data # 독립변수
iris['data'][:3] # 상위 3행만

array([[5.1, 3.5, 1.4, 0.2],
       [4.9, 3. , 1.4, 0.2],
       [4.7, 3.2, 1.3, 0.2]])

In [11]:
# 데이터프레임의 열이름(비추:특수문자는 _ 빼고는 추천안함)
iris.feature_names

['sepal length (cm)',
 'sepal width (cm)',
 'petal length (cm)',
 'petal width (cm)']

In [13]:
# 데어터프레임의 열이름(강추)
[col[:-5].replace(' ',"_") for col in iris.feature_names]

['sepal_length', 'sepal_width', 'petal_length', 'petal_width']

In [16]:
iris.target # ML/DL 학습시 타겟변수(종속변수)
# iris['target']

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2])

In [17]:
iris.target_names

array(['setosa', 'versicolor', 'virginica'], dtype='<U10')

In [19]:
iris.target_names[iris.target] # 데이터프레임에 쓸 타겟변수(대체로 가장 오른쪽 열)

array(['setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica'], dtype='<U10')

In [21]:
# 독립변수
data = iris.data
# 종속변수
target = iris.target_names[iris.target].reshape(-1,1)
print(data[:3],target[:3])

[[5.1 3.5 1.4 0.2]
 [4.9 3.  1.4 0.2]
 [4.7 3.2 1.3 0.2]] [['setosa']
 ['setosa']
 ['setosa']]

In [22]:
print('독립변수 shape :',data.shape)
print('타겟변수 shape :',target.shape)

독립변수 shape : (150, 4)
타겟변수 shape : (150, 1)

In [32]:
# 1. 독립변수와 종속변수를 stack한 후 데이터 프레임으로
df = pd.DataFrame(np.hstack((data,target)),
              columns = iris.feature_names+['spacties'])
df.head(1)

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),spacties
0,5.1,3.5,1.4,0.2,setosa

In [36]:
# df.['sepal length (cm)']
df.columns = [col[:-5].replace(' ',"_") for col in iris.feature_names]+['species']
df.head(1)

  sepal_length sepal_width petal_length petal_width species
0          5.1         3.5          1.4         0.2  setosa

In [38]:
# 2. 독립변수, 종속변수를 따로 데이터프레임으로 생성 -> 두 데이터프레임을 연결
X= pd.DataFrame(iris.data,
               columns=[col[:-5].replace(' ',"_") for col in iris.feature_names])
X.head(1)

   sepal_length  sepal_width  petal_length  petal_width
0           5.1          3.5           1.4          0.2

In [39]:
y=pd.DataFrame(iris.target_names[iris.target], columns=['species'])
y.head(1)

  species
0  setosa

In [41]:
print('X의 shape :', X.shape)
print('y의 shape :', y.shape)
print('X의 index :', X.index)
print('y의 index :', y.index)

X의 shape : (150, 4)
y의 shape : (150, 1)
X의 index : RangeIndex(start=0, stop=150, step=1)
y의 index : RangeIndex(start=0, stop=150, step=1)

In [44]:
iris_df = pd.concat([X,y], axis=1) # 두 개의 데이터프레임을 열로 연결
iris_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

### 2.4.2 iris방법2 : statsmodels

In [13]:
# R 데이터 가져오기
from statsmodels.api import datasets
iris_dataset = datasets.get_rdataset('iris',
                                    package='datasets',
                                    cache=True) # 한 번 다운로드한 데이터를 pc에 저장(cache의 기본값은 False)
iris_dataset

In [15]:
iris = iris_dataset.data
iris.head() # head()의 기본값은 5

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [16]:
iris['Species']
iris.Species

0         setosa
1         setosa
2         setosa
3         setosa
4         setosa
         ...
145    virginica
146    virginica
147    virginica
148    virginica
149    virginica
Name: Species, Length: 150, dtype: object

In [17]:
iris['Sepal.Length']
# iris.Sepal.Length -열 이름에 .아 존재할 경우 이 방식으로 데이터 접근 불가

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: Sepal.Length, Length: 150, dtype: float64

In [22]:
iris.columns=[col.replace(".","_").lower() for col in iris.columns]
iris.head(1)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa

### 2.4.3 iris방법3 : seaborn

In [23]:
import seaborn as sns
iris=sns.load_dataset('iris')
iris.head(1)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa

In [25]:
# 데이터프레임을 파일로 출력
iris.to_csv('data/ch11_iris.csv',
           sep=',', encoding='utf-8', #기본값들
           index=False) #행이름이 생략되서 파일 출력

In [27]:
iris.to_csv('data/ch11_iris.csv.gz',
           index=False,
           compression='infer') # 파일 확장자에 맞게 압축

In [28]:
# read_iris = pd.read_csv('data/ch11_iris.csv')
read_iris = pd.read_csv('data/ch11_iris.csv.gz', compression='infer')
read_iris.head(1)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa

# 3절 이름(열, 행) 지정하기
## 3.1 열이름 지정하기

In [32]:
member = pd.read_csv('data/ch11_member.csv', comment="#",parse_dates=['Birth'])
member.head(1)

  Name  Age          Email  Address      Birth
0  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01

In [33]:
member.columns =['이름','나이','이메일','주소','생일']
member.head(1)

    이름  나이            이메일       주소         생일
0  홍길동  20  hong@hong.com  서울시 강동구 1999-01-01

## 3.2 행이름 지정하기

In [34]:
member.index

RangeIndex(start=0, stop=5, step=1)

In [36]:
member.index = range(11,16)
member

     이름  나이            이메일       주소         생일
11  홍길동  20  hong@hong.com  서울시 강동구 1999-01-01
12  홍길서  30   seo@hong.com   서울시 중구 1999-12-01
13  홍길남  21   nam@hong.com  서울시 강동구 1999-11-01
14  홍길북  22   buk@hong.com  서울시 관악구 1999-05-01
15  홍길중  23   mid@hong.com   부산시 중구 1999-01-30

In [38]:
member.index=['동','서','남','북','중']
member

    이름  나이            이메일       주소         생일
동  홍길동  20  hong@hong.com  서울시 강동구 1999-01-01
서  홍길서  30   seo@hong.com   서울시 중구 1999-12-01
남  홍길남  21   nam@hong.com  서울시 강동구 1999-11-01
북  홍길북  22   buk@hong.com  서울시 관악구 1999-05-01
중  홍길중  23   mid@hong.com   부산시 중구 1999-01-30

In [39]:
member['이름'] # []에는 열이름과 조건만 사용가능(행이름 입력 시 error)

동    홍길동
서    홍길서
남    홍길남
북    홍길북
중    홍길중
Name: 이름, dtype: object

In [40]:
# member['이름']['동'] 비추
member.loc['동', '이름'] # 행과 열이름으로 부분데이터 조회 : loc

'홍길동'

In [44]:
# index를 특정 열로(실행결과가 출력되서 나오면 return만 될 뿐 member는 바뀌지 않음)
# member를 수정하려면 (1) 할당 (2) inplace 매개변수에 True(기본값 False)
member1 = member.set_index('이름')
member1.head(1)

     나이            이메일       주소         생일
이름
홍길동  20  hong@hong.com  서울시 강동구 1999-01-01

In [53]:
member.set_index('이름',inplace=True) #두번 실행 시 에러, 리턴이 아니기에 할당 시 none

In [47]:
member

     나이            이메일       주소         생일
이름
홍길동  20  hong@hong.com  서울시 강동구 1999-01-01
홍길서  30   seo@hong.com   서울시 중구 1999-12-01
홍길남  21   nam@hong.com  서울시 강동구 1999-11-01
홍길북  22   buk@hong.com  서울시 관악구 1999-05-01
홍길중  23   mid@hong.com   부산시 중구 1999-01-30

In [48]:
member.index

Index(['홍길동', '홍길서', '홍길남', '홍길북', '홍길중'], dtype='object', name='이름')

In [54]:
# 인덱스를 컬럼으로 편입시키기, 여러번 실행 시키면 숫자가 데이터로 들어가니 한번만 실행할 것
member.reset_index(inplace=True)

In [59]:
member.index=[0,1,2,0,1]
member

    이름  나이            이메일       주소         생일
0  홍길동  20  hong@hong.com  서울시 강동구 1999-01-01
1  홍길서  30   seo@hong.com   서울시 중구 1999-12-01
2  홍길남  21   nam@hong.com  서울시 강동구 1999-11-01
0  홍길북  22   buk@hong.com  서울시 관악구 1999-05-01
1  홍길중  23   mid@hong.com   부산시 중구 1999-01-30

In [62]:
# 기존의 index를 새로운 열에 편입시키지 않고, 제거한 후 새로운 숫자 index로 초기화
# member.index = range(len(member))
member = member.reset_index(drop=True)
member

    이름  나이            이메일       주소         생일
0  홍길동  20  hong@hong.com  서울시 강동구 1999-01-01
1  홍길서  30   seo@hong.com   서울시 중구 1999-12-01
2  홍길남  21   nam@hong.com  서울시 강동구 1999-11-01
3  홍길북  22   buk@hong.com  서울시 관악구 1999-05-01
4  홍길중  23   mid@hong.com   부산시 중구 1999-01-30

In [64]:
# datatime열에서 날짜 및 시간에 관련된 정보를 추출 : 시리즈(1차원데이터).dt
member['생일'].dt.year

0    1999
1    1999
2    1999
3    1999
4    1999
Name: 생일, dtype: int64

In [65]:
member['생일'].dt.month

0     1
1    12
2    11
3     5
4     1
Name: 생일, dtype: int64

In [66]:
member['생일'].dt.weekday # 0:월, 1:화,.... 5:토, 6:일

0    4
1    2
2    0
3    5
4    5
Name: 생일, dtype: int64

## 3.3 레벨이름 지정하기

In [67]:
member

    이름  나이            이메일       주소         생일
0  홍길동  20  hong@hong.com  서울시 강동구 1999-01-01
1  홍길서  30   seo@hong.com   서울시 중구 1999-12-01
2  홍길남  21   nam@hong.com  서울시 강동구 1999-11-01
3  홍길북  22   buk@hong.com  서울시 관악구 1999-05-01
4  홍길중  23   mid@hong.com   부산시 중구 1999-01-30

In [69]:
print(member.columns)
print(member.columns.name)

Index(['이름', '나이', '이메일', '주소', '생일'], dtype='object')
None

In [71]:
member.columns.name="정보"
member

정보   이름  나이            이메일       주소         생일
0   홍길동  20  hong@hong.com  서울시 강동구 1999-01-01
1   홍길서  30   seo@hong.com   서울시 중구 1999-12-01
2   홍길남  21   nam@hong.com  서울시 강동구 1999-11-01
3   홍길북  22   buk@hong.com  서울시 관악구 1999-05-01
4   홍길중  23   mid@hong.com   부산시 중구 1999-01-30

In [72]:
member.columns = [['기본정보','기본정보','기본정보','추가정보','추가정보'],
                 ['이름','나이','메일','주소','생일']]
member.columns.names=['대분류','소분류']
member

대분류 기본정보                        추가정보
소분류   이름  나이             메일       주소         생일
0    홍길동  20  hong@hong.com  서울시 강동구 1999-01-01
1    홍길서  30   seo@hong.com   서울시 중구 1999-12-01
2    홍길남  21   nam@hong.com  서울시 강동구 1999-11-01
3    홍길북  22   buk@hong.com  서울시 관악구 1999-05-01
4    홍길중  23   mid@hong.com   부산시 중구 1999-01-30

In [73]:
member.index=[['좌우','좌우','상하','상하','상하'],
             ['동','서','남','북','중']]
member.index.names = ['레벨1','레벨2']
member

대분류     기본정보                        추가정보
소분류       이름  나이             메일       주소         생일
레벨1 레벨2
좌우  동    홍길동  20  hong@hong.com  서울시 강동구 1999-01-01
    서    홍길서  30   seo@hong.com   서울시 중구 1999-12-01
상하  남    홍길남  21   nam@hong.com  서울시 강동구 1999-11-01
    북    홍길북  22   buk@hong.com  서울시 관악구 1999-05-01
    중    홍길중  23   mid@hong.com   부산시 중구 1999-01-30

In [74]:
member.loc[("상하",'북'),('기본정보','이름')]

'홍길북'

In [75]:
member.loc['상하','기본정보']

소분류   이름  나이            메일
레벨2
남    홍길남  21  nam@hong.com
북    홍길북  22  buk@hong.com
중    홍길중  23  mid@hong.com

In [77]:
member.loc[("상하",'중'),'기본정보']

소분류
이름             홍길중
나이              23
메일    mid@hong.com
Name: (상하, 중), dtype: object

# 4절 부분 데이터 조회

In [79]:
member=pd.read_csv('data/ch11_member.csv', comment="#",parse_dates=['Birth'])
member

  Name  Age          Email  Address      Birth
0  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01
1  홍길서   30   seo@hong.com   서울시 중구 1999-12-01
2  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01
3  홍길북   22   buk@hong.com  서울시 관악구 1999-05-01
4  홍길중   23   mid@hong.com   부산시 중구 1999-01-30

## 4.1 단일 열 조회

In [80]:
member["Name"]
member.Name

0    홍길동
1    홍길서
2    홍길남
3    홍길북
4    홍길중
Name: Name, dtype: object

In [83]:
# member[0] # 행이름을 []로 조회할 경우 에러
member.loc[0]

Name                       홍길동
Age                         20
Email            hong@hong.com
Address                서울시 강동구
Birth      1999-01-01 00:00:00
Name: 0, dtype: object

In [85]:
member[['Name','Address']]

  Name  Address
0  홍길동  서울시 강동구
1  홍길서   서울시 중구
2  홍길남  서울시 강동구
3  홍길북  서울시 관악구
4  홍길중   부산시 중구

## 4.2 loc을 이용한 조회
- df.loc[행이름, 열이름] : 행이름, 열이름으로 조회
    * 행이름과 열이름 자리에 슬라이싱 가능 from:to => from 부터 to까지(※ to 포함)
    * 행이름과 열이름 자리에 리스트

In [87]:
member.loc[0:2]
member.loc[0:2,]
member.loc[0:2,:]
member.loc[0:2,...] # 모든 열을 다 출력할 경우 열 생략 가능

  Name  Age          Email  Address      Birth
0  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01
1  홍길서   30   seo@hong.com   서울시 중구 1999-12-01
2  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01

In [91]:
member.index = ['동','서','남','북','중']
member.loc['동':'남']

  Name  Age          Email  Address      Birth
동  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01
서  홍길서   30   seo@hong.com   서울시 중구 1999-12-01
남  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01

In [92]:
member.loc['동':'남','Name':'Address'] #동 ~ 남행, Name ~ Address열까지

  Name  Age          Email  Address
동  홍길동   20  hong@hong.com  서울시 강동구
서  홍길서   30   seo@hong.com   서울시 중구
남  홍길남   21   nam@hong.com  서울시 강동구

In [93]:
# 동, 남행, Name, Eamil, Address열
member.loc[['동','남'],['Name','Email','Address']]

  Name          Email  Address
동  홍길동  hong@hong.com  서울시 강동구
남  홍길남   nam@hong.com  서울시 강동구

In [94]:
member.loc[:,'Name']

동    홍길동
서    홍길서
남    홍길남
북    홍길북
중    홍길중
Name: Name, dtype: object

## 4.3 iloc을 이용한 조회
- df.iloc[행순번, 열순번] : 행순번, 열순번으로 조회
    * 행순번과 열순번 자리에 슬라이싱 가능 from:to:by => from 부터 to앞까지 by씩(※ to 미포함)
    * 행순번과 열순번 자리에 리스트

In [95]:
member.iloc[0:3] # 동(0) 행부터 남(2) 행 까지 모든 열

  Name  Age          Email  Address      Birth
동  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01
서  홍길서   30   seo@hong.com   서울시 중구 1999-12-01
남  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01

In [103]:
member.iloc[0:3,0:4]
member.iloc[0:3,0:-1]# 동 ~ 남행, Name(0) ~ Address(3)열까지

  Name  Age          Email  Address
동  홍길동   20  hong@hong.com  서울시 강동구
서  홍길서   30   seo@hong.com   서울시 중구
남  홍길남   21   nam@hong.com  서울시 강동구

In [104]:
# 짝수번째 행의 마지막 열을 제외하고 출력
member.iloc[::2,:-1]

  Name  Age          Email  Address
동  홍길동   20  hong@hong.com  서울시 강동구
남  홍길남   21   nam@hong.com  서울시 강동구
중  홍길중   23   mid@hong.com   부산시 중구

In [105]:
# 마지막 행부터 거꾸로 출력
member.iloc[::-1]

  Name  Age          Email  Address      Birth
중  홍길중   23   mid@hong.com   부산시 중구 1999-01-30
북  홍길북   22   buk@hong.com  서울시 관악구 1999-05-01
남  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01
서  홍길서   30   seo@hong.com   서울시 중구 1999-12-01
동  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01

In [97]:
member.iloc[[0,2],[0,2,3]] # 동, 남행, Name, Eamil, Address열

  Name          Email  Address
동  홍길동  hong@hong.com  서울시 강동구
남  홍길남   nam@hong.com  서울시 강동구

In [101]:
member.iloc[:,0] # Name(0) 열

동    홍길동
서    홍길서
남    홍길남
북    홍길북
중    홍길중
Name: Name, dtype: object

## 4.4 조건으로 조회하기

In [108]:
member

  Name  Age          Email  Address      Birth
동  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01
서  홍길서   30   seo@hong.com   서울시 중구 1999-12-01
남  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01
북  홍길북   22   buk@hong.com  서울시 관악구 1999-05-01
중  홍길중   23   mid@hong.com   부산시 중구 1999-01-30

In [109]:
member['Name']=="홍길남"

동    False
서    False
남     True
북    False
중    False
Name: Name, dtype: bool

In [115]:
# Name이 홍길남인 행을 모두
member[member['Name']=="홍길남"]
member.loc[member['Name']=="홍길남"]
# member.loc[[False,False,True,False,False]] 실제로 사용은 하지 않음

  Name  Age         Email  Address      Birth
남  홍길남   21  nam@hong.com  서울시 강동구 1999-11-01

In [118]:
# Name이 홍길남의 이름과 나이 Email
member.loc[member['Name']=="홍길남",'Name':'Email']

  Name  Age         Email
남  홍길남   21  nam@hong.com

In [119]:
# Name이 홍길남의 이름과 Email
member.loc[member['Name']=="홍길남",['Name','Email']]

  Name         Email
남  홍길남  nam@hong.com

In [120]:
# 23세 이상 데이터 조회(모든 열)
member.loc[member['Age']>=23]

  Name  Age         Email Address      Birth
서  홍길서   30  seo@hong.com  서울시 중구 1999-12-01
중  홍길중   23  mid@hong.com  부산시 중구 1999-01-30

In [125]:
# 23세 이상 데이터 조회(Name, age, Email)
member.loc[member['Age']>=23,['Name','Age','Email']]
member.loc[member['Age']>=23,'Name':'Email']

  Name  Age         Email
서  홍길서   30  seo@hong.com
중  홍길중   23  mid@hong.com

In [123]:
# 23세 이상 데이터 조회(Name, age, Address)
member.loc[member['Age']>=23,['Name','Age','Address']]

  Name  Age Address
서  홍길서   30  서울시 중구
중  홍길중   23  부산시 중구

In [126]:
# ~ : 반대
member[~(member['Age']>=23)]

  Name  Age          Email  Address      Birth
동  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01
남  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01
북  홍길북   22   buk@hong.com  서울시 관악구 1999-05-01

In [131]:
address = "서울시 관악구"
print('서울시로 시작하는지 여부 :', address.startswith("서울시"))
print('중구가 포함되어 있는지 여부 :', address.find('중구') != -1)

서울시로 시작하는지 여부 : True
중구가 포함되어 있는지 여부 : False

In [135]:
# member['Address'].startswith('서울시')

※ 시리즈에 문자함수를 쓰기 위해 참조 (pdf 29page):
https://pandas.pydata.org/pandas-docs/stable/reference/series.html#string-handling

In [136]:
member['Address'].str.startswith('서울시')

동     True
서     True
남     True
북     True
중    False
Name: Address, dtype: bool

In [137]:
#  Address가 서울시로 시작하는 데이터
member[member['Address'].str.startswith('서울시')]

  Name  Age          Email  Address      Birth
동  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01
서  홍길서   30   seo@hong.com   서울시 중구 1999-12-01
남  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01
북  홍길북   22   buk@hong.com  서울시 관악구 1999-05-01

In [138]:
#  Address에 중구를 포함하는 데이터(방법1)
member[member['Address'].str.find('중구')!=-1]

  Name  Age         Email Address      Birth
서  홍길서   30  seo@hong.com  서울시 중구 1999-12-01
중  홍길중   23  mid@hong.com  부산시 중구 1999-01-30

In [140]:
#  Address에 중구를 포함하는 데이터(방법2)
member[member['Address'].str.contains('중구')]

  Name  Age         Email Address      Birth
서  홍길서   30  seo@hong.com  서울시 중구 1999-12-01
중  홍길중   23  mid@hong.com  부산시 중구 1999-01-30

In [143]:
# 시리즈.isin([])
# 이름이 홍길동이거나 홍길남인 데이터
member.loc[member['Name'].isin(['홍길동','홍길남'])]

  Name  Age          Email  Address      Birth
동  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01
남  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01

In [144]:
# 이름이 홍길동이거나 홍길남인 데이터의 이름, 주소, 생일
member.loc[member['Name'].isin(['홍길동','홍길남']),['Name','Address','Birth']]

  Name  Address      Birth
동  홍길동  서울시 강동구 1999-01-01
남  홍길남  서울시 강동구 1999-11-01

In [148]:
# 2000년 이전에 태어난 데이터
member[member['Birth'].dt.year < 2000]

  Name  Age          Email  Address      Birth
동  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01
서  홍길서   30   seo@hong.com   서울시 중구 1999-12-01
남  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01
북  홍길북   22   buk@hong.com  서울시 관악구 1999-05-01
중  홍길중   23   mid@hong.com   부산시 중구 1999-01-30

In [154]:
# 조건 연산자를 이용해서 추출(조건2개)
data = pd.DataFrame({'eng':[np.nan,80,np.nan,85],
                    'kor':[100,80,60,np.nan]})
display(data)
# 영어 80점 이상이고, 국어 80 이상인 데이터 추출
data[(data['eng']>=80) & (data['kor']>=80)]

    eng    kor
0   NaN  100.0
1  80.0   80.0
2   NaN   60.0
3  85.0    NaN

    eng   kor
1  80.0  80.0

In [155]:
# 결측치 확인 방법1
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   eng     2 non-null      float64
 1   kor     3 non-null      float64
dtypes: float64(2)
memory usage: 192.0 bytes

In [157]:
# 결측치 확인 방법2
data.isna() # 결측치 여부

     eng    kor
0   True  False
1  False  False
2   True  False
3  False   True

In [159]:
True+True+False

2

In [158]:
data.isna().sum(axis=0) # 각 열의 결측치 갯수

eng    2
kor    1
dtype: int64

※ 데이터 프레임의 부분 데이터 조회방법
- df[열이름] : 특정열 조회
- df[조건] : 조건에 맞는 모든 행 조회
- df.loc[행이름,열이름]
    - 행이름, 열이름 자리에 슬라이싱, 리스트
    - 열이름 생략시 모든 열
- df.iloc[행순번,열순번]
    - 행순번, 열순번 자리에 슬라이싱, 리스트
    - 열순번 생략시 모든 열

- 데이터프레임 조건 추출 quiz

In [215]:
# iris가져오기
import seaborn as sns
iris=sns.load_dataset('iris')
# display(iris)

# 1. sepal_length 열만 출력
iris['sepal_length']

# 2. 0~10행까지 마지막 열을 제외한 데이터 (loc, iloc)
iris.loc[:10,:'petal_width']
iris.iloc[:11,:-1]

# 3. 3~10 행중에 'sepal_length'와 'petal_length' 열만 (loc, iloc)
iris.loc[3:10,['sepal_length','petal_length']]
iris.iloc[3:11,[0,2]]

# 4. 0번째, 50번째, 100번째 행의 모든 열 (loc, iloc)
iris.loc[[0,50,100]]
# iris.loc[0:100:5]
iris.iloc[[0,50,100]]
# iris.iloc[0:101:5]

# 5. 0번째, 25, 50번째, 75번, 100번째, 125번째 행의 petal_length와 petal_width (loc, iloc)
iris.loc[[0,25,50,75,100,125],['petal_length','petal_width']]
iris.loc[[0:125:25,['petal_length','petal_width']]
iris.iloc[[0,25,50,75,100,125],[2,3]]

# 6. species가 versicolor인 데이터의 모든 열
iris.loc[iris['species'].isin(['versicolor'])]

# 7. species가 setosa인 데이터 최초 5개 행만 출력
setosa5 = iris.loc[iris['species'].isin(['setosa'])].copy()
setosa5[:5]

# 8. sepal_length가 6.5이상인 데이터 최초 5개 행만 출력
sepal_length5 = iris.loc[iris['sepal_length']>=6.5].copy()
sepal_length5[:5]

# 9. sepal_length가 7.2이상인 데이터의 'sepal_length'와 'sepal_width'와 'petal_length'
iris.loc[iris['sepal_length']>=7.2,:'petal_length']

# 10. versicolor종중에서 sepal_length가 6.5보다 큰 데이터의 모든 열
iris.loc[iris['species'].isin(['versicolor']) & (iris['sepal_length'] >= 6.5)]

In [216]:
import numpy as np

In [217]:
# 조건이 많거나 복잡할 때 사용
np.logical_and(iris['species']=='versicolor',
              iris['sepal_length'] >= 6.5)

0      False
1      False
2      False
3      False
4      False
       ...
145    False
146    False
147    False
148    False
149    False
Length: 150, dtype: bool

# 5절 데이터 삭제 및 추가
## 5.1 데이터프레임의 요소 삭제
- df.drop(삭제할 열이름이나 행이름, axis) : axis=0 일 떈 행삭제 axis=1 일 땐 열 삭제

In [220]:
member

  Name  Age          Email  Address      Birth
동  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01
서  홍길서   30   seo@hong.com   서울시 중구 1999-12-01
남  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01
북  홍길북   22   buk@hong.com  서울시 관악구 1999-05-01
중  홍길중   23   mid@hong.com   부산시 중구 1999-01-30

In [219]:
# 1) 단일 행 삭제
member.drop('중') # axis=0 (기본값)  : 해당 행 삭제
#삭제한 결과르 member 적용 (1) 할당 member=member.drop('중',axis=0)
#                       (2) member.drop('중',axis=0, inplace=True)

  Name  Age          Email  Address      Birth
동  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01
서  홍길서   30   seo@hong.com   서울시 중구 1999-12-01
남  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01
북  홍길북   22   buk@hong.com  서울시 관악구 1999-05-01

In [223]:
# 2) 복수 행 삭제
member.drop(['동','서','남'])

  Name  Age         Email  Address      Birth
북  홍길북   22  buk@hong.com  서울시 관악구 1999-05-01
중  홍길중   23  mid@hong.com   부산시 중구 1999-01-30

In [224]:
# 3) 열 삭제
member.drop(['Name','Email'],axis=1)

   Age  Address      Birth
동   20  서울시 강동구 1999-01-01
서   30   서울시 중구 1999-12-01
남   21  서울시 강동구 1999-11-01
북   22  서울시 관악구 1999-05-01
중   23   부산시 중구 1999-01-30

## 5.2 데이터 프레임의 요소 추가

In [226]:
# 1) 열 추가
member['nickname'] ="빼꼼이"
member

  Name  Age          Email  Address      Birth nickname
동  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01      빼꼼이
서  홍길서   30   seo@hong.com   서울시 중구 1999-12-01      빼꼼이
남  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01      빼꼼이
북  홍길북   22   buk@hong.com  서울시 관악구 1999-05-01      빼꼼이
중  홍길중   23   mid@hong.com   부산시 중구 1999-01-30      빼꼼이

In [231]:
# 2) 리스트를 이용한 열 추가
member['favorite_no']=[3,2,7,None,12]
member

  Name  Age          Email  Address      Birth nickname  favorite_no
동  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01      빼꼼이          3.0
서  홍길서   30   seo@hong.com   서울시 중구 1999-12-01      빼꼼이          2.0
남  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01      빼꼼이          7.0
북  홍길북   22   buk@hong.com  서울시 관악구 1999-05-01      빼꼼이          NaN
중  홍길중   23   mid@hong.com   부산시 중구 1999-01-30      빼꼼이         12.0

In [233]:
# 3) favorite_num에 결측치를 할당 후 데이터 재 할당
member['favorite_num']=None # 숫자를 같이 입력시 None는 NaN, None만 입력시 None
member

,Name,Age,Email,Address,Birth,nickname,favorite_no,favorite_num
동,홍길동,20,hong@hong.com,서울시 강동구,1999-01-01,빼꼼이,3.0,None
서,홍길서,30,seo@hong.com,서울시 중구,1999-12-01,빼꼼이,2.0,None
남,홍길남,21,nam@hong.com,서울시 강동구,1999-11-01,빼꼼이,7.0,None
북,홍길북,22,buk@hong.com,서울시 관악구,1999-05-01,빼꼼이,NaN,None
중,홍길중,23,mid@hong.com,부산시 중구,1999-01-30,빼꼼이,12.0,None

In [232]:
member['favorite_num']=np.nan
member.iloc[::2,-1]=7
member

,Name,Age,Email,Address,Birth,nickname,favorite_no,favorite_num
동,홍길동,20,hong@hong.com,서울시 강동구,1999-01-01,빼꼼이,3.0,7.0
서,홍길서,30,seo@hong.com,서울시 중구,1999-12-01,빼꼼이,2.0,NaN
남,홍길남,21,nam@hong.com,서울시 강동구,1999-11-01,빼꼼이,7.0,7.0
북,홍길북,22,buk@hong.com,서울시 관악구,1999-05-01,빼꼼이,NaN,NaN
중,홍길중,23,mid@hong.com,부산시 중구,1999-01-30,빼꼼이,12.0,7.0

In [244]:
member.drop(['Email','Birth','nickname','favorite_no','favorite_num'],axis=1, inplace= True)

In [245]:
member

  Name  Age  Address
동  홍길동   20  서울시 강동구
서  홍길서   30   서울시 중구
남  홍길남   21  서울시 강동구
북  홍길북   22  서울시 관악구
중  홍길중   23   부산시 중구

In [250]:
# 4) 딕셔너리로 행 추가
new_member= pd.DataFrame([{'Name':'홍길숙', 'Age':30, 'Address':'서울'}])
member = pd.concat([member, new_member]).reset_index(drop=True) # 여러번 실행시 실행한 횟수만큼 추가

In [251]:
member

  Name  Age  Address
0  홍길동   20  서울시 강동구
1  홍길서   30   서울시 중구
2  홍길남   21  서울시 강동구
3  홍길북   22  서울시 관악구
4  홍길중   23   부산시 중구
5  홍길숙   30       서울
6  홍길숙   30       서울

# 6절  병합과 연결
## 6.1 merge()를 이용한 데이터프레임 연결

In [262]:
df1= pd.DataFrame({'key':['a','b','c','d'],
                  'c1':[1,2,3,4]})
df2= pd.DataFrame({'key':['a','b','c','f'],
                  'c2':[10,20,30,40]})
df1.merge(df2) # how='inner' (기본값): 내부조인 (양쪽이 다 일치하는 데이터만 병합)

  key  c1  c2
0   a   1  10
1   b   2  20
2   c   3  30

In [263]:
df1.merge(df2, how='left') # 왼쪽의 df1 데이터는 모두 남기고 오른쪽 df2가 매칭되도록

  key  c1    c2
0   a   1  10.0
1   b   2  20.0
2   c   3  30.0
3   d   4   NaN

In [264]:
df1.merge(df2, how='right') # 오른쪽의 df2 데이터는 모두 남기고 왼쪽 df1이 매칭되도록

  key   c1  c2
0   a  1.0  10
1   b  2.0  20
2   c  3.0  30
3   f  NaN  40

In [265]:
df1.merge(df2, how='outer') # 양쪽 df1, df2 모두 남김

  key   c1    c2
0   a  1.0  10.0
1   b  2.0  20.0
2   c  3.0  30.0
3   d  4.0   NaN
4   f  NaN  40.0

In [269]:
df3= pd.DataFrame({'key3':['a','b','c','d'],
                  'c3':[1,2,3,4]})
df4= pd.DataFrame({'key4':['a','b','c','f'],
                  'c4':[10,20,30,40]})
df3.merge(df4, left_on='key3', right_on='key4', how='inner')

  key3  c3 key4  c4
0    a   1    a  10
1    b   2    b  20
2    c   3    c  30

## 6.2 concat()을 이용한 데이터프레임 연결
- pd.concat([df1,df2,df3...], axis)
    * axis = 0 (기본값) : 위아래로 연결
    * axis = 1 : 좌우로 연결

In [272]:
df3= pd.DataFrame({'key3':['a','b','c','d'],
                  'c3':[1,2,3,4]})
df4= pd.DataFrame({'key4':['a','b','c','f'],
                  'c4':[10,20,30,40]})
pd.concat([df3,df4], axis =1) # 좌우 연결

  key3  c3 key4  c4
0    a   1    a  10
1    b   2    b  20
2    c   3    c  30
3    d   4    f  40

In [274]:
df3= pd.DataFrame({'key':['a','b','c','d'],
                  'c1':[1,2,3,4]})
df4= pd.DataFrame({'key':['a','b','c','f'],
                  'c1':[10,20,30,40]})
pd.concat([df3,df4]).reset_index(drop=True)

  key  c1
0   a   1
1   b   2
2   c   3
3   d   4
4   a  10
5   b  20
6   c  30
7   f  40

# 7절 정렬(행이름, 열이름,값에 의한 정렬)
- df.sort_index(axis) : 행 또는 열 이름으로 정렬
- df.sort_value(by=[정렬기준이될 열이름], ascending= T/F, inplace=T/F) : 특정 열 값에 의한 정렬

In [277]:
member = pd.read_csv('data/ch11_member.csv', comment="#")
member.index=['동','서','남','북','중']
member

  Name  Age          Email  Address       Birth
동  홍길동   20  hong@hong.com  서울시 강동구  1999-01-01
서  홍길서   30   seo@hong.com   서울시 중구  1999-12-01
남  홍길남   21   nam@hong.com  서울시 강동구  1999-11-01
북  홍길북   22   buk@hong.com  서울시 관악구  1999-05-01
중  홍길중   23   mid@hong.com   부산시 중구  1999-01-30

## 7.1 행 이름으로 정렬

In [280]:
member.sort_index(axis=0, inplace=True) # ascending=True (기본값) : 오름차순 
member

  Name  Age          Email  Address       Birth
남  홍길남   21   nam@hong.com  서울시 강동구  1999-11-01
동  홍길동   20  hong@hong.com  서울시 강동구  1999-01-01
북  홍길북   22   buk@hong.com  서울시 관악구  1999-05-01
서  홍길서   30   seo@hong.com   서울시 중구  1999-12-01
중  홍길중   23   mid@hong.com   부산시 중구  1999-01-30

## 7.2 행 이름으로 정렬

In [282]:
member.sort_index(axis= 1, inplace=True)  # axis= 'columns'
member

   Address  Age       Birth          Email Name
남  서울시 강동구   21  1999-11-01   nam@hong.com  홍길남
동  서울시 강동구   20  1999-01-01  hong@hong.com  홍길동
북  서울시 관악구   22  1999-05-01   buk@hong.com  홍길북
서   서울시 중구   30  1999-12-01   seo@hong.com  홍길서
중   부산시 중구   23  1999-01-30   mid@hong.com  홍길중

## 7.3 값에 의한 정렬

In [283]:
member.sort_values(by='Age') # Age 기준으로 오름차순(ascending=True)

   Address  Age       Birth          Email Name
동  서울시 강동구   20  1999-01-01  hong@hong.com  홍길동
남  서울시 강동구   21  1999-11-01   nam@hong.com  홍길남
북  서울시 관악구   22  1999-05-01   buk@hong.com  홍길북
중   부산시 중구   23  1999-01-30   mid@hong.com  홍길중
서   서울시 중구   30  1999-12-01   seo@hong.com  홍길서

In [284]:
member.sort_values(by='Age', ascending=False)

   Address  Age       Birth          Email Name
서   서울시 중구   30  1999-12-01   seo@hong.com  홍길서
중   부산시 중구   23  1999-01-30   mid@hong.com  홍길중
북  서울시 관악구   22  1999-05-01   buk@hong.com  홍길북
남  서울시 강동구   21  1999-11-01   nam@hong.com  홍길남
동  서울시 강동구   20  1999-01-01  hong@hong.com  홍길동

In [285]:
# Age 기준으로 내림차순, Age 같으면 Email 기준 오름차순
member.loc[:,'Age']=[20,20,30,30,30]
member

   Address  Age       Birth          Email Name
남  서울시 강동구   20  1999-11-01   nam@hong.com  홍길남
동  서울시 강동구   20  1999-01-01  hong@hong.com  홍길동
북  서울시 관악구   30  1999-05-01   buk@hong.com  홍길북
서   서울시 중구   30  1999-12-01   seo@hong.com  홍길서
중   부산시 중구   30  1999-01-30   mid@hong.com  홍길중

In [287]:
member.sort_values(by=["Age",'Email'], ascending=[False,True])

   Address  Age       Birth          Email Name
북  서울시 관악구   30  1999-05-01   buk@hong.com  홍길북
중   부산시 중구   30  1999-01-30   mid@hong.com  홍길중
서   서울시 중구   30  1999-12-01   seo@hong.com  홍길서
동  서울시 강동구   20  1999-01-01  hong@hong.com  홍길동
남  서울시 강동구   20  1999-11-01   nam@hong.com  홍길남